# SQL Basic Statements: Foundation for Database Operations

## Introduction

Before diving into advanced concepts like primary keys, foreign keys, and constraints, it's essential to understand the fundamental SQL statements that allow you to interact with databases. This notebook covers the core SQL operations you'll use every day as a data engineer.

**What you'll learn:**
- SQL syntax basics
- DDL (Data Definition Language) statements
- DML (Data Manipulation Language) statements
- INSERT operations
- DELETE operations
- TRUNCATE vs DELETE
- Essential SQL concepts

---

## 1. Understanding SQL Statement Structure

### Basic SQL Syntax Rules

SQL statements follow a consistent structure:

1. **Keywords are case-insensitive** (but conventionally written in UPPERCASE)
2. **Statements end with a semicolon** (`;`) in most databases
3. **Whitespace is generally ignored** (use it for readability)
4. **Strings are enclosed in single quotes** (`'text'`)

### Example Structure:
```sql
KEYWORD column1, column2
FROM table_name
WHERE condition;
```

**Note:** Not all statements follow this exact pattern, but most do.

---

## 2. SQL Statement Categories

SQL statements are organized into categories based on their purpose:

### DDL - Data Definition Language
**Purpose:** Define and modify database structure
- `CREATE` - Create tables, databases, indexes
- `ALTER` - Modify existing structures
- `DROP` - Delete structures
- `TRUNCATE` - Remove all data from a table

### DML - Data Manipulation Language
**Purpose:** Manipulate data within tables
- `SELECT` - Query/retrieve data
- `INSERT` - Add new rows
- `UPDATE` - Modify existing rows
- `DELETE` - Remove specific rows

### DCL - Data Control Language
**Purpose:** Control access and permissions
- `GRANT` - Give permissions
- `REVOKE` - Remove permissions

### TCL - Transaction Control Language
**Purpose:** Manage transactions
- `COMMIT` - Save changes
- `ROLLBACK` - Undo changes
- `SAVEPOINT` - Create transaction checkpoints

**Focus of this notebook:** DDL and DML (the most commonly used)

## 3. DDL Statements: Creating and Modifying Database Structure

### 3.1 CREATE Statement

The `CREATE` statement is used to create new database objects like tables, databases, or indexes.

#### Creating a Table

**Basic Syntax:**
```sql
CREATE TABLE table_name (
    column1 datatype constraints,
    column2 datatype constraints,
    column3 datatype constraints
);
```

**Example:**
```sql
CREATE TABLE employees (
    employee_id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(100),
    hire_date DATE,
    salary DECIMAL(10, 2)
);
```

**Key Points:**
- Each column has a name and data type
- Common data types: `INT`, `VARCHAR(n)`, `DATE`, `DECIMAL(p, s)`, `BOOLEAN`
- Constraints can be added (we'll cover these in detail later)

#### Creating a Database
```sql
CREATE DATABASE company_db;
```

#### Creating an Index
```sql
CREATE INDEX idx_email ON employees(email);
```

---

### 3.2 ALTER Statement

The `ALTER` statement modifies existing database structures without dropping and recreating them.

#### Adding a Column
```sql
ALTER TABLE employees
ADD COLUMN department VARCHAR(50);
```

#### Modifying a Column
```sql
ALTER TABLE employees
ALTER COLUMN salary DECIMAL(12, 2);
```

#### Dropping a Column
```sql
ALTER TABLE employees
DROP COLUMN department;
```

#### Adding Constraints
```sql
ALTER TABLE employees
ADD CONSTRAINT pk_employee PRIMARY KEY (employee_id);
```

---

### 3.3 DROP Statement

The `DROP` statement permanently deletes database objects.

**Warning:** This is irreversible! Be very careful.

#### Dropping a Table
```sql
DROP TABLE employees;
```

#### Dropping a Database
```sql
DROP DATABASE company_db;
```

#### Dropping an Index
```sql
DROP INDEX idx_email;
```

**Key Difference:**
- `DROP TABLE` removes the table structure AND all data
- `DELETE` removes only data (we'll see this in DML section)

## 4. DML Statements: Working with Data

### 4.1 SELECT Statement

The `SELECT` statement retrieves data from one or more tables.

#### Basic SELECT
```sql
-- Select all columns
SELECT * FROM employees;

-- Select specific columns
SELECT first_name, last_name, salary FROM employees;
```

#### SELECT with WHERE Clause
```sql
SELECT * FROM employees
WHERE salary > 50000;
```

#### SELECT with ORDER BY
```sql
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC;
```

#### SELECT with Aggregate Functions
```sql
SELECT 
    department,
    COUNT(*) as employee_count,
    AVG(salary) as avg_salary
FROM employees
GROUP BY department;
```

**Note:** We'll cover SELECT in more detail in advanced SQL topics. For now, understand it's used to query/retrieve data.

---

### 4.2 INSERT Statement

The `INSERT` statement adds new rows to a table.

#### Method 1: Insert with Column Names (Recommended)
```sql
INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, salary)
VALUES (1, 'John', 'Doe', 'john.doe@company.com', '2024-01-15', 75000);
```

**Advantages:**
- Clear which values go to which columns
- Order doesn't matter
- Can omit columns with default values

#### Method 2: Insert Without Column Names
```sql
INSERT INTO employees
VALUES (2, 'Jane', 'Smith', 'jane.smith@company.com', '2024-02-20', 80000);
```

**Requirements:**
- Must provide values for ALL columns in the exact table order
- Less flexible, more error-prone

#### Method 3: Insert Multiple Rows
```sql
INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, salary)
VALUES 
    (3, 'Bob', 'Johnson', 'bob.johnson@company.com', '2024-03-10', 70000),
    (4, 'Alice', 'Williams', 'alice.williams@company.com', '2024-03-15', 85000),
    (5, 'Charlie', 'Brown', 'charlie.brown@company.com', '2024-04-01', 72000);
```

#### Method 4: Insert from Another Table
```sql
INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, salary)
SELECT employee_id, first_name, last_name, email, hire_date, salary
FROM temp_employees
WHERE hire_date > '2024-01-01';
```

**Common INSERT Scenarios:**
- Adding new records
- Migrating data between tables
- Bulk data loading
- Data backfilling

### 4.3 UPDATE Statement

The `UPDATE` statement modifies existing rows in a table.

#### Basic UPDATE
```sql
UPDATE employees
SET salary = 80000
WHERE employee_id = 1;
```

**Critical:** Always use `WHERE` clause! Without it, ALL rows are updated.

#### UPDATE Multiple Columns
```sql
UPDATE employees
SET 
    salary = 85000,
    email = 'john.doe.new@company.com'
WHERE employee_id = 1;
```

#### UPDATE with Calculations
```sql
UPDATE employees
SET salary = salary * 1.10  -- 10% raise
WHERE department = 'Engineering';
```

#### UPDATE from Another Table
```sql
UPDATE employees e
SET salary = t.new_salary
FROM temp_salaries t
WHERE e.employee_id = t.employee_id;
```

**Best Practices:**
1. Always test with SELECT first: `SELECT * FROM employees WHERE employee_id = 1;`
2. Use transactions for critical updates
3. Backup data before bulk updates

### 4.4 DELETE Statement

The `DELETE` statement removes specific rows from a table.

#### Basic DELETE
```sql
DELETE FROM employees
WHERE employee_id = 5;
```

**Critical:** Always use `WHERE` clause! Without it, ALL rows are deleted.

#### DELETE Multiple Rows
```sql
DELETE FROM employees
WHERE department = 'Sales' AND hire_date < '2020-01-01';
```

#### DELETE All Rows (Dangerous!)
```sql
DELETE FROM employees;
-- This removes ALL rows but keeps the table structure
```

**How DELETE Works:**
1. Deletes row by row
2. Can be rolled back (if in a transaction)
3. Triggers can fire (if defined)
4. Slower for large tables
5. Maintains table structure

**When to Use DELETE:**
- Remove specific rows based on conditions
- Need to rollback the operation
- Want to maintain table structure
- Need to fire triggers or maintain referential integrity

## 5. TRUNCATE vs DELETE: Critical Differences

Both `TRUNCATE` and `DELETE` remove data from a table, but they work very differently.

### TRUNCATE Statement

**Syntax:**
```sql
TRUNCATE TABLE employees;
```

**How TRUNCATE Works:**
1. Removes ALL rows instantly
2. Cannot use WHERE clause (always removes all data)
3. Cannot be rolled back (in most databases)
4. Resets auto-increment counters
5. Faster than DELETE for large tables
6. Doesn't fire triggers (in most databases)
7. Maintains table structure

**Example:**
```sql
TRUNCATE TABLE employees;
-- All employee data is gone, but table structure remains
```

---

### DELETE Statement (Recap)

**Syntax:**
```sql
DELETE FROM employees;  -- Removes all rows
-- OR
DELETE FROM employees WHERE condition;  -- Removes specific rows
```

**How DELETE Works:**
1. Removes rows one by one
2. Can use WHERE clause (selective deletion)
3. Can be rolled back (if in a transaction)
4. Doesn't reset auto-increment counters
5. Slower for large tables
6. Fires triggers (if defined)
7. Maintains table structure

---

### Side-by-Side Comparison

| Feature | DELETE | TRUNCATE |
|---------|--------|----------|
| **WHERE clause** | âœ… Yes | âŒ No (always all rows) |
| **Rollback** | âœ… Yes (in transaction) | âŒ No (in most DBs) |
| **Speed** | ðŸŒ Slower | âš¡ Faster |
| **Auto-increment reset** | âŒ No | âœ… Yes |
| **Triggers fire** | âœ… Yes | âŒ No |
| **Row-by-row** | âœ… Yes | âŒ No (bulk operation) |
| **Logging** | âœ… Detailed | âš ï¸ Minimal |
| **Locking** | Row-level locks | Table-level lock |

---

### When to Use DELETE

âœ… **Use DELETE when:**
- You need to remove specific rows (with WHERE clause)
- You need the operation to be rollback-able
- You have triggers that must fire
- You need detailed logging of what was deleted
- You're working with a small number of rows

**Example:**
```sql
DELETE FROM employees
WHERE hire_date < '2020-01-01';
-- Removes only old employees
```

---

### When to Use TRUNCATE

âœ… **Use TRUNCATE when:**
- You want to remove ALL rows from a table
- You need maximum performance (large tables)
- You don't need rollback capability
- You want to reset auto-increment counters
- You're clearing staging/temporary tables

**Example:**
```sql
TRUNCATE TABLE staging_orders;
-- Fast way to clear staging table before new data load
```

---

### Real-World Analogy

**DELETE** is like removing specific items from a shopping cart one by one.
- You can be selective
- You can undo it
- Takes time if you have many items

**TRUNCATE** is like emptying the entire shopping cart at once.
- Everything goes
- Can't undo
- Instant operation

---

### Important Notes

**Both DELETE and TRUNCATE:**
- Keep the table structure intact
- Don't remove the table itself (use DROP for that)
- Are DML operations (data manipulation)

**Safety Tip:**
Always backup important data before using DELETE or TRUNCATE!

## 6. Essential SQL Concepts

### 6.1 WHERE Clause

The `WHERE` clause filters rows based on conditions. It's used with SELECT, UPDATE, and DELETE.

#### Comparison Operators
```sql
-- Equal
SELECT * FROM employees WHERE salary = 75000;

-- Not equal
SELECT * FROM employees WHERE department != 'Sales';

-- Greater than / Less than
SELECT * FROM employees WHERE salary > 50000;
SELECT * FROM employees WHERE salary < 100000;

-- Greater than or equal / Less than or equal
SELECT * FROM employees WHERE salary >= 75000;
SELECT * FROM employees WHERE salary <= 100000;
```

#### Logical Operators
```sql
-- AND
SELECT * FROM employees 
WHERE department = 'Engineering' AND salary > 70000;

-- OR
SELECT * FROM employees 
WHERE department = 'Sales' OR department = 'Marketing';

-- NOT
SELECT * FROM employees 
WHERE NOT department = 'HR';
```

#### Pattern Matching (LIKE)
```sql
-- Starts with
SELECT * FROM employees WHERE email LIKE 'john%';

-- Ends with
SELECT * FROM employees WHERE email LIKE '%@company.com';

-- Contains
SELECT * FROM employees WHERE email LIKE '%doe%';

-- Single character wildcard
SELECT * FROM employees WHERE first_name LIKE 'J_n';  -- Jan, Jon, etc.
```

#### IN and NOT IN
```sql
SELECT * FROM employees 
WHERE department IN ('Engineering', 'Sales', 'Marketing');

SELECT * FROM employees 
WHERE department NOT IN ('HR', 'Finance');
```

#### NULL Handling
```sql
-- Check for NULL
SELECT * FROM employees WHERE department IS NULL;

-- Check for NOT NULL
SELECT * FROM employees WHERE email IS NOT NULL;
```

---

### 6.2 ORDER BY Clause

Sorts the result set.

```sql
-- Ascending (default)
SELECT * FROM employees ORDER BY salary;

-- Descending
SELECT * FROM employees ORDER BY salary DESC;

-- Multiple columns
SELECT * FROM employees 
ORDER BY department ASC, salary DESC;
```

---

### 6.3 LIMIT / TOP Clause

Limits the number of rows returned.

```sql
-- MySQL, PostgreSQL
SELECT * FROM employees LIMIT 10;

-- SQL Server
SELECT TOP 10 * FROM employees;

-- Oracle
SELECT * FROM employees WHERE ROWNUM <= 10;
```

---

### 6.4 Comments in SQL

```sql
-- Single-line comment

/* 
   Multi-line comment
   Useful for documentation
*/

SELECT * FROM employees;  -- Inline comment
```

---

### 6.5 Data Types Overview

Common SQL data types you'll encounter:

| Type | Description | Example |
|------|-------------|---------|
| `INT` / `INTEGER` | Whole numbers | `123` |
| `DECIMAL(p, s)` | Fixed-point numbers | `123.45` (p=5, s=2) |
| `VARCHAR(n)` | Variable-length string | `'John'` |
| `CHAR(n)` | Fixed-length string | `'ABC'` (padded) |
| `DATE` | Date only | `'2024-01-15'` |
| `TIMESTAMP` | Date and time | `'2024-01-15 10:30:00'` |
| `BOOLEAN` | True/False | `TRUE`, `FALSE` |
| `TEXT` | Large text | Long descriptions |

---

### 6.6 Common SQL Functions

#### String Functions
```sql
-- Concatenate
SELECT CONCAT(first_name, ' ', last_name) AS full_name FROM employees;

-- Uppercase / Lowercase
SELECT UPPER(first_name) FROM employees;
SELECT LOWER(email) FROM employees;

-- Length
SELECT LENGTH(first_name) FROM employees;

-- Substring
SELECT SUBSTRING(email, 1, 5) FROM employees;
```

#### Date Functions
```sql
-- Current date/time
SELECT CURRENT_DATE;
SELECT CURRENT_TIMESTAMP;
SELECT NOW();  -- MySQL/PostgreSQL

-- Extract parts
SELECT EXTRACT(YEAR FROM hire_date) FROM employees;
SELECT YEAR(hire_date) FROM employees;  -- MySQL
```

#### Aggregate Functions
```sql
SELECT 
    COUNT(*) AS total_employees,
    AVG(salary) AS avg_salary,
    MAX(salary) AS max_salary,
    MIN(salary) AS min_salary,
    SUM(salary) AS total_payroll
FROM employees;
```

## 7. Practical Examples: Complete Workflow


### Step 1: Create a Table
```sql
CREATE TABLE products (
    product_id INT,
    product_name VARCHAR(100),
    category VARCHAR(50),
    price DECIMAL(10, 2),
    stock_quantity INT
);
```

### Step 2: Insert Data
```sql
INSERT INTO products (product_id, product_name, category, price, stock_quantity)
VALUES 
    (1, 'Laptop', 'Electronics', 999.99, 50),
    (2, 'Mouse', 'Electronics', 29.99, 200),
    (3, 'Desk Chair', 'Furniture', 199.99, 30),
    (4, 'Monitor', 'Electronics', 299.99, 75);
```

### Step 3: Query Data
```sql
SELECT * FROM products WHERE category = 'Electronics';
```

### Step 4: Update Data
```sql
UPDATE products
SET price = 949.99
WHERE product_id = 1;
```

### Step 5: Delete Specific Data
```sql
DELETE FROM products
WHERE stock_quantity = 0;
```

### Step 6: Clear All Data (if needed)
```sql
TRUNCATE TABLE products;
-- Or
DELETE FROM products;  -- Slower but rollback-able
```

### Step 7: Drop Table (when done)
```sql
DROP TABLE products;
```

---

## 8. Best Practices and Common Mistakes

### âœ… Best Practices

1. **Always use WHERE with UPDATE and DELETE**
   ```sql
   -- âœ… Good
   DELETE FROM employees WHERE employee_id = 5;
   
   -- âŒ Dangerous
   DELETE FROM employees;  -- Deletes everything!
   ```

2. **Use transactions for critical operations**
   ```sql
   BEGIN TRANSACTION;
   UPDATE accounts SET balance = balance - 100 WHERE id = 1;
   UPDATE accounts SET balance = balance + 100 WHERE id = 2;
   COMMIT;  -- Or ROLLBACK if something goes wrong
   ```

3. **Specify column names in INSERT**
   ```sql
   -- âœ… Good (clear and flexible)
   INSERT INTO employees (first_name, last_name, email) 
   VALUES ('John', 'Doe', 'john@company.com');
   
   -- âš ï¸ Less clear
   INSERT INTO employees VALUES (1, 'John', 'Doe', 'john@company.com', ...);
   ```

4. **Test with SELECT before UPDATE/DELETE**
   ```sql
   -- First, see what will be affected
   SELECT * FROM employees WHERE salary < 30000;
   
   -- Then, perform the operation
   DELETE FROM employees WHERE salary < 30000;
   ```

5. **Use meaningful table and column names**
   ```sql
   -- âœ… Good
   CREATE TABLE customer_orders (...);
   
   -- âŒ Bad
   CREATE TABLE tbl1 (...);
   ```

### âŒ Common Mistakes

1. **Forgetting WHERE clause in UPDATE/DELETE**
   - Results in updating/deleting ALL rows

2. **Using single quotes for numbers**
   ```sql
   -- âŒ Wrong
   WHERE salary = '50000';  -- Treats as string
   
   -- âœ… Correct
   WHERE salary = 50000;  -- Treats as number
   ```

3. **Case sensitivity in string comparisons**
   ```sql
   -- May behave differently in different databases
   WHERE department = 'Engineering';  -- vs 'engineering'
   ```

4. **Not handling NULL values correctly**
   ```sql
   -- âŒ Wrong (NULL comparisons don't work this way)
   WHERE department = NULL;
   
   -- âœ… Correct
   WHERE department IS NULL;
   ```

---

## 9. Summary

### Key Takeaways

1. **DDL** (CREATE, ALTER, DROP, TRUNCATE) manages database structure
2. **DML** (SELECT, INSERT, UPDATE, DELETE) manages data
3. **DELETE** removes specific rows and can be rolled back
4. **TRUNCATE** removes all rows quickly but cannot be rolled back
5. **Always use WHERE clause** with UPDATE and DELETE
6. **Test with SELECT** before modifying data
7. **Use transactions** for critical operations

### What's Next?

Now that you understand basic SQL statements, you're ready to learn about:
- Primary Keys and Foreign Keys
- Constraints (NOT NULL, UNIQUE, CHECK)
- Joins (combining data from multiple tables)
- Advanced SELECT queries
- Indexes and performance optimization

---

**Remember:** SQL is a powerful tool. With great power comes great responsibility. Always test your statements, especially DELETE and UPDATE operations!